_site/HoTT/introduccion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-27 Wed 21:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introducción</title>
<meta name="author" content="Mou" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-brand">
    <a href="/index.html">🏠 Mis Notas</a>
  </div>
  <div class="navbar-menu">
    <div class="navbar-item dropdown">
      <a href="#" class="dropbtn">🤖 AI</a>
      <div class="dropdown-content">
        <a href="/AI/index.html">📋 Resumen</a>
        <div class="dropdown-submenu">
          <a href="#" class="submenu-btn">📚 CS229 ▶</a>
          <div class="submenu-content">
            <a href="/AI/CS229/index.html">📋 Resumen</a>
            <a href="/AI/CS229/AprendizajeSupervisado/aprendizaje_supervisado.html">🎯 Aprendizaje Supervisado</a>
            <a href="/AI/CS229/AprendizajeSupervisado/regresion_lineal.html">📈 Regresión Lineal</a>
          </div>
        </div>
        <div class="dropdown-submenu">
          <a href="#" class="submenu-btn">🏗️ DataCamp ▶</a>
          <div class="submenu-content">
            <a href="/AI/DataCamp/index.html">📋 Resumen</a>
            <a href="/AI/DataCamp/desglosando_el_transformer.html">🔍 Desglosando el Transformer</a>
            <a href="/AI/DataCamp/embedding_y_codificacion_posicional.html">🔗 Embedding y Codificación Posicional</a>
          </div>
        </div>
      </div>
    </div>
    <div class="navbar-item dropdown">
      <a href="#" class="dropbtn">🔬 HoTT</a>
      <div class="dropdown-content">
        <a href="/HoTT/index.html">📋 Resumen</a>
        <a href="/HoTT/introduccion.html">🚀 Introducción</a>
        <a href="/HoTT/juicios.html">⚖️ Juicios</a>
      </div>
    </div>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Introducción</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8c87dbd">1. Background</a>
<ul>
<li><a href="#orgc34f5b6">1.1. Intuisionistic Type Theory</a></li>
<li><a href="#org9622651">1.2. El programa de Brouwer (Constructivismo)</a></li>
<li><a href="#org246a50c">1.3. Sintético vs. Analítico (Lawvere)</a></li>
</ul>
</li>
<li><a href="#org380cb39">2. ¿Qué es la teoría de tipos?</a></li>
<li><a href="#orgdccb013">3. Lógica intuicionista (Lógica como si importaran las personas)</a>
<ul>
<li><a href="#org0443bab">3.1. Fragmento negativo</a></li>
<li><a href="#org58b0e5e">3.2. Implicación</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8c87dbd" class="outline-2">
<h2 id="org8c87dbd"><span class="section-number-2">1.</span> Background</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc34f5b6" class="outline-3">
<h3 id="orgc34f5b6"><span class="section-number-3">1.1.</span> Intuisionistic Type Theory</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Basado en el trabajo de Per Martin-Löf</li>
<li>Análisis y expansión del programa de intuicionsimo de Brouwer</li>
</ul>

<p>
Hay una teoría base de la teoría de tipos y algunas extensiones:
</p>

<ul class="org-ul">
<li>ITT (Intentional Type Theory): Punto de partida</li>
<li>ETT (Extensional Type Theory): Adición de la reflexividad de la igualdad y unicidad de 
pruebas de identidad. (Inspirado por el trabajo de Bishop, teoría de conjuntos 
constructiva). Aquí los tipos son conjuntos</li>
<li>HoTT (Homotopy Type Theory): Adición de los higher inductive types y el axioma de
univalencia. Aquí los tipos son espacios (un tanto abstractos). Las pruebas son relevantes
y estableceremos que las pruebas de relaciones están enlazadas con las trayectorias en los
espacios</li>
</ul>
</div>
</div>
<div id="outline-container-org9622651" class="outline-3">
<h3 id="org9622651"><span class="section-number-3">1.2.</span> El programa de Brouwer (Constructivismo)</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>La matemática es una actividad humana (social)
<ul class="org-ul">
<li>El lenguaje para comunicar ideas matemáticas</li>
</ul></li>
<li>La facultad humana fundamental es el concepto de algoritmo para realizar una construcción
como hacían los Griegos</li>
<li><p>
Las pruebas son una forma de construcción 
</p>
<ul class="org-ul">
<li>Relevancia de las demostraciones, las demostraciones son objetos matemáticos que podemos</li>
</ul>
<p>
manipular como cualquier otro (ésta es la distinción radical)
</p></li>
</ul>

<p>
Hilbert se oponía al programa de Brouwer y estaba equivocado. No hay oposición entre 
la teoría de tipos y los patrones de la matemática. Una de las cosas centrales es 
la libertad axiomática del constructivismo. Menos suposiciones llevan a resultados más 
fuertes, en particular, la ley del tercio excluso, no es que el principio sea falso, solo 
que no es necesario afirmarlo. 
</p>
</div>
</div>
<div id="outline-container-org246a50c" class="outline-3">
<h3 id="org246a50c"><span class="section-number-3">1.3.</span> Sintético vs. Analítico (Lawvere)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
En la teoría homotópica de tipos el acercamiento es sintético, a diferencia del camino 
usual, que es analítico. Este acercamiento es lo que hace funcionar a la teoría 
homotópica de tipos.
</p>
</div>
</div>
</div>
<div id="outline-container-org380cb39" class="outline-2">
<h2 id="org380cb39"><span class="section-number-2">2.</span> ¿Qué es la teoría de tipos?</h2>
<div class="outline-text-2" id="text-2">
<p>
La teoría de tipos es un análisis y codificación del programa de Brouwer. 
Especialmente con insights en la teoría de la demostración.
</p>

<p>
Hay una noción de tipo, que clasifica cuales son las construcciones válidas.
Para decir cuáles son los tipos aceptables tenemos reglas:
</p>

<ul class="org-ul">
<li>Reglas de introducción: cómo crear una construcción</li>
<li>Reglas de eliminación: cómo eliminar una construcción</li>
</ul>

<p>
Tenemos una forma de enlazar las reglas de introducción con las reglas de eliminación, 
el principio de inversión (principio de conservación de pruebas): El eliminador es, por lo 
menos, post-inverso al introductor, sólo podemos sacar lo que hemos introducido.
</p>

<p>
Las reglas de introducción nos dicen qué son las construcciones y las reglas de eliminación 
nos dicen cómo computar. 
</p>

<p>
La intención es que esto sea suficiente para englobar toda la actividad matemática, en 
particular, las formas de las pruebas.
</p>

<p>
La teoría de tipos es la teoría unificada de la computación. Es lo que son los lenguajes 
de programación.
</p>
</div>
</div>
<div id="outline-container-orgdccb013" class="outline-2">
<h2 id="orgdccb013"><span class="section-number-2">3.</span> Lógica intuicionista (Lógica como si importaran las personas)</h2>
<div class="outline-text-2" id="text-3">
<p>
Hay dos juicios principales:
</p>

<ol class="org-ol">
<li><code>A Prop</code>: A es una proposición</li>
<li><code>A True</code>: A es una proposición verdadera (tiene una demostración)</li>
</ol>

<p>
No esperamos que cada proposición pueda ser demostrada o refutada (hay problemas abiertos).
</p>
</div>
<div id="outline-container-org0443bab" class="outline-3">
<h3 id="org0443bab"><span class="section-number-3">3.1.</span> Fragmento negativo</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org32bbdfd" class="outline-4">
<h4 id="org32bbdfd"><span class="section-number-4">3.1.1.</span> Proposición trivialmente verdadera</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
\[\begin{align*}
  &\frac{}{\top ~ Prop} ~ (\top-Formation)\\\\
  &\frac{}{\top ~ True} ~ (\top-introduction)
\end{align*}\]
</p>

<p>
No hay regla de eliminación.
</p>
</div>
</div>
<div id="outline-container-orgf5cfe01" class="outline-4">
<h4 id="orgf5cfe01"><span class="section-number-4">3.1.2.</span> Conjunción</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
\[\begin{align*}
  &\frac{A ~ Prop ~~~ B ~ Prop}{A \land B ~ Prop} ~ (\land-Formation)\\\\
  &\frac{A ~ True ~~~ B ~ True}{A \land B ~ True} ~ (\land-Introduction)
\end{align*}\]
</p>

<p>
Para \(\land\) sí hay reglas de eliminación
\[
  \frac{A \land B ~ True}{A ~ True} ~ (\land-Elimination_1) ~~~~~~
  \frac{A \land B ~ True}{B ~ True} ~ (\land-Elimination_2)
\]
</p>
</div>
</div>
</div>
<div id="outline-container-org58b0e5e" class="outline-3">
<h3 id="org58b0e5e"><span class="section-number-3">3.2.</span> Implicación</h3>
<div class="outline-text-3" id="text-3-2">
<p>
\[\begin{align*}
  &\frac{A ~ Prop ~~~ B ~ Prop}{ A \supset B ~ Prop} ~ (\supset-Formation)\\\\
  &\frac{A ~ True \vdash B ~ True}{A \supset B ~ True} ~ (\supset-Introduction)
\end{align*}\]
</p>

<p>
Aquí \(\vdash\) significa vinculación lógica, no necesariamente implicación lógica.
</p>

<p>
También hay reglas de eliminación
\[
  \frac{A \supset B ~ True ~~~ A ~ True}{B ~ True} ~ (\supset-Elimination)
\]</p>
</div>
</div>
</div>
</div>
</body>
</html>
